{
  "addExpiresOrCacheControlHeaders": {
    "title": "Add Expires or Cache-Control HTTP Headers",
    "description": "You should reach 100% of resources cached.",
    "correction": "The Expires and Cache-Control headers determine how long a browser should keep a resource in its cache. You should therefore use them, and configure them correctly for CSS style sheets, JavaScript scripts and images. Ideally, these elements should be kept as long as possible so that the browser does not request them again from the server. This saves HTTP requests, bandwidth and CPU power server-side.Here is a configuration example for Expires and Cache-Control headers for the Apache web server: <pre>&lt;IfModule mod_headers.c></pre><pre>   &nbsp;&lt;FilesMatch &quot&#92.(ico|jpe?g|png|gif|swf|css|gz)$&quot></pre><div><pre>        Header set Cache-Control &quotmax-age=2592000, public&quot</pre><pre>    &lt;/FilesMatch></pre><pre>    &lt;FilesMatch  &quot&#92.(html|htm)$&quot></pre><pre>       Header set Cache-Control &quotmax-age=7200, public&quot</pre><pre>    &lt;/FilesMatch></pre><pre> &lt;/IfModule></pre>Government Regulation: RGESN 6.3 : Does the digital service use caching mechanisms for all transferred content under its control? See : Cache Header Cache-Control HeadersExpires Headers",
    "titleData": "{0}% of resources cached"
  },
  "compressHttp": {
    "title": "Compress ressources",
    "description": "To get an A score, reach 100 % of compression ratio.",
    "correction": "You can compress the content of HTML pages to minimize bandwidth consumption between the client and the server. All modern browsers (for smartphones, tablets, notebook and desktop computers) accept HTML compressed via gzip or Deflate. The easiest way to do so is to configure the web server so that it compresses the HTML data stream, either on-the-fly or automatically, as it leaves the server. This practice (on-the-fly compression) is only beneficial for a HTML data stream as it is constantly evolving. When possible, we recommend that you manually compress static resources (e.g. CSS and JavaScript libraries) all in one go. With Apache, the Deflate and gzip compression methods offer considerable savings. A typical 26 KB HTML file is reduced to 6 KB after being compressed with gzip. If your frontend framework is one of the following: React / Angular / Vue.js If your front-end framework is React Government Regulation; RGESN 6.4 : Has the digital service implemented compression techniques on all transferred resources under its control? See : Http Compress How to compress HTML code ?",
    "titleData": "{0}% of resources compressed"
  },
  "domainsNumber": {
    "title": "Limit the number of domains",
    "description": "You should limit the number of domains to 3 per page.",
    "correction": " When a website or online service hosts a web page's components across several domains, the browser must establish an HTTP connection with every single one. Once the HTML page has been retrieved, the browser calls the sources as it traverses the DOM (Document Object Model).  Some resources are essential for the page to work. If they are hosted on another domain which is slow, it may increase the page's render time. You should therefore, when possible, group all resources on a single domain. The only exception to this is for static resources (style sheets, images, etc.), which should be hosted on a separate domain to avoid sending one or multiple cookies for each browser GET HTTP request. This reduces response time and unnecessary bandwidth consumption. For a corporate website with heavy traffic, it is better to have two domains: - the application server at www.domain.tld - the cookieless media server at media.domain.tld By doing so, you minimize the number of domains while also avoiding unnecessarily sending a cookie for each GET HTTP request for a static resource. Best practices n°82 from '115 bonnes pratiques d'écoconception web v4' See : What is a domain number and how does it works Minimize the number of domains  ",
    "titleData": "{0} domain(s) found per page in average"
  },
  "dontResizeImageInBrowser": {
    "title": "Don't resize image in browser",
    "description": "There should be no image resized in browser in your web application. You are resizing an image if you are using the attributes HEIGHT and WIDTH in the HTML tag of the image.",
    "correction": "Do not resize images using HTML height and width attributes. Doing so sends images in their original size, wasting bandwidth and CPU power. A PNG-24 350 x 300 px image is 41 KB. If you resized the same image file using HTML and displayed it as a 70 x 60 px thumbnail, it would still be 41 KB, when it should be no more than 3 KB! Meaning 38 KB downloaded for nothing. The best solution is to resize images using software such as Photoshop, without using HTML. When content added by the website's users has no specific added value, it is best to prevent them from being able to insert images using a WYSIWYG editor e.g., CKEditor.  Non Compliant : <img src={LoadingIconPath} alt=”loading icon”  width = ”12px” height = ”12px” > Compliant : <img src={LoadingIconPath} alt=”loading icon” /> Government Regulation: RGESN 5.2 Does the digital service offer image content whose level of compression is appropriate for the content and viewing context?See : How to resize image outside the browser ",
    "titleData": "{0} image(s) resized in browser found in the whole project"
  },
  "emptySrcTag": {
    "title": "Avoid empty src tag",
    "description": "You should have no empty src tags.",
    "correction": "If there is an image tag with an empty src attribute, the browser will call the directory in which the page is located, generating unnecessary, additional HTTP requests.The following image tag will request the foo directory's index file from the server: <img src=”” alt=””> for a page located at: http://domain.tld/foo/bar.htmlSee : Delete image tags with empty src attributes",
    "titleData": "{0} empty src tags found in the whole project"
  },
  "externalizeCss": {
    "title": "Externalize css",
    "description": "You should reach 0 inline stylesheets.",
    "correction": "Ensure that CSS files and JavaScript code are separate from the page's HTML code, except for any configuration variables for JavaScript objects.   If you include CSS or JavaScript code in the body of the HTML file, and it is used for several pages (or even the whole website), then the code must be sent for each page requested by the user, therefore increasing the volume of data sent.  However, if the CSS and JavaScript code are in their own separate files, the browser can avoid requesting them again by storing them in its local cache.    <div class=\"compliance-title\">Non compliant :<div class=\"compliance-example\">&lt;style type=\"text/css\" media=\"screen\">    p { color: #333, margin: 2px 0 }/* All the website's CSS declarations */    &lt;/style>    <div class=\"compliance-title\">    Compliant :<div class=\"compliance-example\"><div class=\"\"description\"\">&lt;link href=\"css/styles.css\" rel=\"stylesheet\">Best practices n°42 from '115 bonnes pratiques d'écoconception web v4'  See : Externalize CSS files How to create a css external stylesheet",
    "titleData": "{0} inline stylesheet(s) found in the whole project"
  },
  "externalizeJs": {
    "title": "Externalize js",
    "description": "You should have no inline JavaScript script in HTML code.",
    "correction": "Ensure that JavaScript code is separate from the page's HTML code, except for any configuration variables for JavaScript objects. If you include JavaScript code in the body of the HTML file, and it is used for several pages (or even the whole website), then the code must be sent for each page requested by the user, therefore increasing the volume of data sent. However, if the JavaScript code is in his own separate file, the browser can avoid requesting them again by storing them in its local cache.    <div class=\"compliance-title\">Non Compliant :   <div class=\"compliance-example\">File 1 Avoid using script directly into HTML : &lt;script type=\"\"text\/javascript\"\"> alert(\"\"Hello Jean ! \"\")  &lt;\/script>&ltbutton onclick=alert('Hello Jeanne')>Say Hello Jeanne&lt;/button>  <div class=\"compliance-title\">Compliant : <div class=\"compliance-example\">Instead use a JavaScript file where the function is defined : script: function sayHello(name) {      alert(\"\"Hello\"\" + name +\"\" ! \"\")}&lt;script type=\"\"text\/javascript\"\">sayHello(Jean)&lt;\/script>Best practices n°42 from '115 bonnes pratiques d'écoconception web v4'See :  Externalize JS Files Externalize JavaScript Files",
    "titleData": "{0} inline javascripts found in the whole project"
  },
  "httpError": {
    "title": "Avoid HTTP request errors",
    "description": "You should not have HTTP errors when loading your pages.",
    "correction": "Requests with HTTP errors consume resources unnecessarily.Best practices n°89 from '115 bonnes pratiques d'écoconception web v4' See : How to troubleshoot common http error code",
    "titleData": "{0} HTTP error(s) in the whole project"
  },
  "httpRequests": {
    "title": "Limit the number of HTTP requests",
    "description": "A page's download time client-side directly correlates to the number and size of files the browser must download. You should not have more than 25 requests to load one page of your application.",
    "correction": "For each file, the browser sends a GET HTTP to the server. It waits for the response, and then downloads the resource as soon as it is available. Depending on the type of web server you use, the more requests per page there are, the fewer pages the server can handle. Reducing the number of requests per page is key to reducing the number of HTTP servers needed to run the website, and consequently its environmental impact.There are several ways to reduce the number of requests per page: - Combine static files e.g., CSS and JavaScript libraries - Use a CSS sprite to group the interface's images  - Favor glyphs over images and, in general, vectors over bitmaps. - Fill in the browser cache as much as possible.Potential saving: reduced server load, thus minimizing the economic and environmental footprint by reducing the amount of equipment needed (from HTTP servers to application servers and RDBMS).Best practices n°47 from '115 bonnes pratiques d'écoconception web v4'Government Regulation: RGESN 6.2 : Does the digital service have a limit of requests per screen? See : Limit HTTP Requests",
    "titleData": "{0} HTTP request(s) on average"
  },
  "imageDownloadedNotDisplayed": {
    "title": "Do not download unecessary image",
    "description": "You should not request images from the server if they are not going to be displayed in your web application.",
    "correction": "Downloading images that will not necessarily be visible consumes resources unnecessarily. For example, images that are displayed only after a user action.Government Regulation: RGESN 5.2 Does the digital service offer image content whose level of compression is appropriate for the content and viewing context?",
    "titleData": "{0} image(s) downloaded but not displayed in the whole project"
  },
  "jsValidate": {
    "title": "Validate js",
    "description": "You shouldn't have JavaScript errors when launching your web application.",
    "correction": "JSLint is a JavaScript code quality tool that checks that the JavaScript syntax used will be understood by all browsers. The code produced thus complies with coding rules which enables interpreters to quickly and easily run the code. The CPU is therefore used for a shorter time.Install eslint to analyse your code   npm install eslint --save-dev or yarn add -D eslintOnce installed, you can launch eslint project configuration npx eslint --initThe command prompt will guide you through the linter configuration adapted to your projet. The file name .eslintrc defines the linter configuration and can be modified according to your requirement.To launch the linter analysis : eslint --ext .js .To let the linter fix issues automatically :eslint --fix --ext .js .Best practices n°82 from '115 bonnes pratiques d'écoconception web v4'See : Check JavaScript code",
    "titleData": "{0} JavaScript error(s) found in the whole project"
  },
  "maxCookiesLength": {
    "title": "Max cookies length",
    "description": "Maximum size of your cookies should be the smallest possible as it is sent with each request. Your cookies should not be longer than 512 bytes.",
    "correction": "A cookie makes it possible to maintain a state between the internet user's browser and the remote web server thanks to identifiers. This text file is transferred in each http request. It is therefore necessary to optimize its size as much as possible and delete it as soon as its presence is no longer mandatory.    You can automatically delete a cookie when it is no longer useful, by specifying an expiry date, as follows:    Set-Cookie: user_myvariable=myvalue; expires=Wed, 12 Dec 2012 07:40:20 UTC    See :  Using HTTP cookies    ",
    "titleData": "Max cookies length = {0} Bytes, in the whole project"
  },
  "minifiedCss": {
    "title": "Minified css",
    "description": "You should reach 100% of your CSS files minified.",
    "correction": "You can use the Yahoo's YUI Compressor specialized filters to :- remove comments and white spaces - remove the last semi-colon - remove extra semi-colons  - remove empty declarations  - remove units of measure when using 0 values and reduce multiple 0s into one - remove 0 for values less than 1  - convert RGB colors into hex values and reduce 6-digit hex values to 3-digit values - remove extra charsets - optimize the alpha layer's opacity values in Internet Explorer  - replace none with 0Government Regulation: RGESN 6.4 : Has the digital service implemented compression techniques on all transferred resources under its control? See : CSS Minification ",
    "titleData": "{0}% of minified stylesheet"
  },
  "minifiedJs": {
    "title": "Minified js",
    "description": "You should reach 100% of your JS files minified.",
    "correction": "Use a tool such as YUI Compressor to :- remove unnecessary white spaces  - remove unnecessary line breaks - remove unnecessary semi-colons - shorten local variable names  This operation can be automated using Google Apache speed moduleA standard 248 KB JavaScript file will be 97KB after being minifiedGovernment Regulation: RGESN 6.4 : Has the digital service implemented compression techniques on all transferred resources under its control?See : JavaScript minification ",
    "titleData": "{0}% of minified JavaScript"
  },
  "noCookieForStaticRessources": {
    "title": "No cookie for static ressources",
    "description": "You should have 0 static resources with cookies.",
    "correction": "Images, CSS stylesheets, and JavaScript files must be hosted on a cookie-free domain. This prevents the browser from sending a cookie for each resource ... when it is unnecessary. Indeed, although transferred in each http request, the cookie is useless for static content, since it is used to maintain a state between the Internet user's browser and the remote application server thanks to the identifiers contained in the text file.. It is therefore preferable to store this type of content on a specific domain name, for example static.domainname.com. For static resources, a cookie is unnecessary, so it unnecessarily consumes bandwidth. To avoid this, we can use a different domain for static resources or restrict the scope of cookies created. Web Giants are using a dedicated domain to serve static ressources which does not require cookies. For example, Yahoo! uses the domain called yimg.com, Youtube ytimg.com and Amaon images-amazon.comGovernment Regulation: RGESN 6.11 : Does the digital service host the transferred static resources of which it is the issuer on the same domain?See : Serve static content from a cookieless domain. Why do you need a cookie-less domain",
    "titleData": "{0} static ressource(s) with cookie in the whole project"
  },
  "noRedirect": {
    "title": "Avoid redirect",
    "description": "Redirections should be avoided as much as possible as they slow down response and drain resources unnecessarily.",
    "correction": "These redirections can take place on various levels: HTML code, JavaScript code, HTTP server and application server. Best practices n°112 from '115 bonnes pratiques d'écoconception web v4' See : Avoid redirections Avoid multiple page redirects",
    "titleData": "{0} redirect in the whole project"
  },
  "optimizeBitmapImages": {
    "title": "Optimize bitmap images",
    "description": "You should optimize all your bitmap images.",
    "correction": "The first step is to choose the correct format between bitmap (e.g., JPEG, PNG & GIF) and vector (SVG).    Bitmaps should only be used for photos and interface elements that are not possible though icons or CSS styling.The choice of bitmap format depends on the image's characteristics: black and white or color, color palette, need for transparency, etc. For these characteristics, the ability to use lossy compression on the image is more suited to JPEG and WebP (Google); while the need for transparency and/or lossless compression is more suited to GIF or PNG.Tools such as pngcrush, ImageMagick and jpegtran will help you reduce the size of images as much as possible.Potential saving: At least 25% saved by fine-tuning the color palette and the compression ratio, and up to over 80% compared to a uncompressed bitmap. WebP is on average 30% smaller than JPEG.Government Regulation: RGESN 5.2 Does the digital service offer image content whose level of compression is appropriate for the content and viewing context? See : Optimize Bitmap images",
    "titleData": "{0} bitmap image to optimize in the whole project"
  },
  "optimizeSvg": {
    "title": "Optimize svg images",
    "description": "All SVG images added into your web application should be optimized.",
    "correction": "Svg images are less heavy than bitmap images, nevertheless they can be optimized and minified via tools (for example, svgo).Government Regulation: RGESN 5.2 Does the digital service offer image content whose level of compression is appropriate for the content and viewing context? See : Tools for optimizing SVG",
    "titleData": "{0} images to optimize in the whole project"
  },
  "plugins": {
    "title": "Do not use plugins",
    "description": "You should use no plugin in your web application if possible.",
    "correction": "Avoid using plugins (Flash Player, Java and Silverlight virtual machines, etc.) because they can be a heavy drain on resources (CPU and RAM).This is especially true with Adobe's Flash Player, to such an extent that Apple decided to not install the technology on its mobile devices to maximize battery life. Favor standard technology such as HTML5 and ECMAScript. See : Limit plugins  ",
    "titleData": "{0} plugin found in the whole project"
  },
  "printStyleSheet": {
    "title": "Provide print stylesheet",
    "description": "Each of your pages should have at least one print style sheet to get an A Score.",
    "correction": "In addition to the benefits for the user, this style sheet reduces the number of pages printed, and therefore indirectly minimizes the website's ecological footprint. It should be as streamlined as possible and employ an ink-light typeface e.g., Century Gothic. Also consider hiding the header, footer, menu and sidebar, as well as deleting all images except those needed for content. This print style sheet makes for a cleaner print by trimming down what is displayed on the screen. Compliant : Best practices n°31 from '115 bonnes pratiques d'écoconception web v4' See : Print Stylesheet CSS Printer Friendly Pages. How to set up a print stylesheet Print stylesheet guide",
    "titleData": "{0} print stylesheet found in the whole project"
  },
  "socialNetworkButton": {
    "title": "Do not use standards social button",
    "description": "You should not use social media buttons.",
    "correction": "Social Network like Facebook, Twitter, Pinterest gives plugins to install on web page to get a share button and a like counter. These plugins consume unnecessary resources, it's better to put direct links.Best practices n°59 from '115 bonnes pratiques d'écoconception web v4'",
    "titleData": "{0} standard(s) social button(s) found in the whole project"
  },
  "styleSheets": {
    "title": "Limit Stylesheet files",
    "description": "You should have at most 2 stylesheets per page.",
    "correction": "Minimize the number of CSS files to reduce the number of HTTP requests. If several style sheets are used on all the website's pages, concatenate them into one single file.Some CMS and frameworks offer ways to do such optimization automatically. The HTTP server can also be configured to compress and reduce the size of style sheets.With the Apache web server, simply add the following line in the .htaccess configuration file:# compress css:AddOutputFilterByType DEFLATE text/cssThis instruction activates the Deflate mode which compresses all the style sheets between the server and the HTTP client. Learn more about DeflateBest practices n°35 from '115 bonnes pratiques d'écoconception web v4'",
    "titleData": "{0} stylesheet(s) found on average"
  },
  "useETags": {
    "title": "Use ETags",
    "description": "ETags limit the number of server requests and avoid unnecessary use of bandwidth. At least 95 % of your resources should have ETags to have a B Score.",
    "correction": "An ETag is a signature attached to a server response. If the client requests a URL (HTML page, image, style sheet, etc.) whose ETag is identical to the one it already has, the web server will reply that it does not need to download the resource and that it should use the one it already possesses. Using ETags saves huge amounts of bandwidth.Refer to the File Etag documentation for Apache: Apache documentation on EtagSee : ETags Use ETags Header",
    "titleData": "{0}% of resources with ETags "
  },
  "useStandardTypefaces": {
    "title": "Use Standard Typefaces",
    "description": "You should reduce the size of custom fonts used.",
    "correction": "Use standard typefaces as they already exist on the user's computer, and therefore do not need to be downloaded. This saves bandwidth and improves the website's render time. When possible, use typefaces such as : Courrier New Georgia Arial Comic Impact Tahoma Trebuchet MS Times New Roman Verdana Segoe UI Best practices n°32 from '115 bonnes pratiques d'écoconception web v4' See : Use standard typefaces List of typeface included with MacOS X Revised Font Stack",
    "titleData": "{0} KB custom fonts found in the whole project"
  }
}